import React, { useState, useEffect } from "react";
import { Tabs, Card, Row, Col, Typography } from "antd";
import axios from "axios";

const Financial = () => {
  return (
    <Row justify='center'>
      <Col span={22}>
        <Row justify="start" gutter={[20, 40]} style={{ marginTop: "60px",marginBottom:'40px' }}>
          <Col span={7}>
            <Card
              size="small"
              title="Free"
              extra={<a href="#">More</a>}
              style={{ width: "100%" ,height:"500px" }}
            >
            <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
            <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
            <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
            <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
            <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
            <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="3000"
              extra={<a href="#">More</a>}
              style={{ width: "100%",height:"500px"  }}
            >
             <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
            <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
            <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
            <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
            <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
            <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="6000"
              extra={<a href="#">More</a>}
              style={{ width: "100%",height:"500px"  }}
            >
             <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
            <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
            <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
            <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
            <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
            <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="9000"
              extra={<a href="#">More</a>}
              style={{ width: "100%" ,height:"500px" }}
            >
          <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
            <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
            <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
            <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
            <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
            <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="12000"
              extra={<a href="#">More</a>}
              style={{ width: "100%" ,height:"500px" }}
            >
          <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
            <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
            <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
            <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
            <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
            <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
            </Card>
          </Col>
        </Row>
      </Col>
    </Row>
  );
};
export default Financial;
