import React, { useState, useEffect } from "react";
import { Tabs, Card, Row, Col, Typography } from "antd";
import axios from "axios";

const Financial = () => {
  return (
    <Row justify="center">
      <Col span={22}>
        <Row
          justify="start"
          gutter={[20, 40]}
          style={{ marginTop: "60px", marginBottom: "40px" }}
        >
          <Col span={7}>
            <Card
              size="small"
              title="Free"
              extra={<a href="#">More</a>}
              style={{ width: "100%", height: "500px" }}
            >
              <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
              <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
              <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
              <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
              <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
              <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="3000"
              extra={<a href="#">More</a>}
              style={{ width: "100%", height: "500px" }}
            >
              <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
              <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
              <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
              <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
              <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
              <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งบริษัท</p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งห้างร้าน</p>
              <p>
                ให้คำปรึกษา จดทะเบียนเปลี่ยนแปลง/แก้ไขนิติบุคคล ( เปลี่ยนชื่อ,
                ที่อยู่, เพิ่มทุน, ลดทุน, กรรมการเข้า-ออก อื่นๆ )
              </p>
              <p>ให้คำปรึกษา จดทะเบียนเลิกกิจการและชำระบัญชี</p>
              <p>ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี งบไม่เคลื่อนไหว</p>
              <p>ให้คำปรึกษา บริการจัดทำบัญชีรายเดือน </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="6000"
              extra={<a href="#">More</a>}
              style={{ width: "100%", height: "500px" }}
            >
              <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
              <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
              <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
              <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
              <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
              <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งบริษัท</p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งห้างร้าน</p>
              <p>
                ให้คำปรึกษา จดทะเบียนเปลี่ยนแปลง/แก้ไขนิติบุคคล ( เปลี่ยนชื่อ,
                ที่อยู่, เพิ่มทุน, ลดทุน, กรรมการเข้า-ออก อื่นๆ )
              </p>
              <p>ให้คำปรึกษา จดทะเบียนเลิกกิจการและชำระบัญชี</p>
              <p>ให้คำปรึกษา แจ้งเข้า - แจ้งออกพนักงานในระบบประกันสังคม</p>
              <p>ให้คำปรึกษา นำส่ง เงินสบทบประกันสังคมประจำเดือน</p>
              <p>ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี งบไม่เคลื่อนไหว</p>
              <p>ให้คำปรึกษา บริการจัดทำบัญชีรายเดือน </p>
              <p>
                ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี รายได้ไม่เกิน 5
                ล้านบาท / ปี
              </p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="9000"
              extra={<a href="#">More</a>}
              style={{ width: "100%", height: "500px" }}
            >
              <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
              <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
              <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
              <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
              <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
              <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งห้างร้าน</p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งบริษัท</p>
              <p>
                ให้คำปรึกษา จดทะเบียนเปลี่ยนแปลง/แก้ไขนิติบุคคล ( เปลี่ยนชื่อ,
                ที่อยู่, เพิ่มทุน, ลดทุน, กรรมการเข้า-ออก อื่นๆ )
              </p>
              <p>ให้คำปรึกษา จดทะเบียนเลิกกิจการและชำระบัญชี</p>
              <p>ให้คำปรึกษา แจ้งเข้า - แจ้งออกพนักงานในระบบประกันสังคม</p>
              <p>ให้คำปรึกษา นำส่ง เงินสบทบประกันสังคมประจำเดือน</p>
              <p>ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี งบไม่เคลื่อนไหว</p>
              <p>ให้คำปรึกษา บริการจัดทำบัญชีรายเดือน </p>
              <p>
                ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี รายได้ไม่เกิน 5
                ล้านบาท / ปี
              </p>
              <p>ให้คำปรึกษา ยื่นขอรับการส่งเสริม BOI - อนุมัติโครงการ</p>
              <p>
                ให้คำปรึกษา งานยื่นช่างฝีมือผู้ชำนาญการต่างประเทศ
                Workpermit/Visa BOI
              </p>
              <p>ให้คำปรึกษา งานยื่นขออนุญาตถือครองกรรมสิทธิ์ที่ดิน BOI</p>
              <p>ให้คำปรึกษา งานยื่นขออนุญาตลิซซิ่ง BOI</p>
            </Card>
          </Col>
          <Col span={7}>
            <Card
              size="small"
              title="12000"
              extra={<a href="#">More</a>}
              style={{ width: "100%", height: "500px" }}
            >
              <p>ให้คำปรึกษา ร้านค้าใช้คนละครึ่ง</p>
              <p>ให้คำปรึกษา ภาษีบุคคลธรรมดา ( ภ.ง.ด. 90 / ภ.ง.ด. 94 )</p>
              <p>ให้คำปรึกษา ภาษีมูลค่าเพิ่ม ( รายได้เกิน 1,800,000 ) ภ.พ.30</p>
              <p>ให้คำปรึกษา และการจัดเตรียมเอกสารด้านบัญชี</p>
              <p>ให้คำปรึกษา ยื่นภาษีเงินได้ บุคคลธรรมดา และ นิติบุคคล</p>
              <p>ให้คำปรึกษา ยื่นภาษีขายออนไลน์ </p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งห้างร้าน</p>
              <p>ให้คำปรึกษา จดทะเบียนจัดตั้งบริษัท</p>
              <p>
                ให้คำปรึกษา จดทะเบียนเปลี่ยนแปลง/แก้ไขนิติบุคคล ( เปลี่ยนชื่อ,
                ที่อยู่, เพิ่มทุน, ลดทุน, กรรมการเข้า-ออก อื่นๆ )
              </p>
              <p>ให้คำปรึกษา จดทะเบียนเลิกกิจการและชำระบัญชี</p>
              <p>ให้คำปรึกษา แจ้งเข้า - แจ้งออกพนักงานในระบบประกันสังคม</p>
              <p>ให้คำปรึกษา นำส่ง เงินสบทบประกันสังคมประจำเดือน</p>
              <p>ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี งบไม่เคลื่อนไหว</p>
              <p>ให้คำปรึกษา บริการจัดทำบัญชีรายเดือน </p>
              <p>
                ให้คำปรึกษา บริการสอบบัญชีงบการเงินประจำปี รายได้ไม่เกิน 5
                ล้านบาท / ปี
              </p>
              <p>ให้คำปรึกษา ยื่นขอรับการส่งเสริม BOI - อนุมัติโครงการ</p>
              <p>
                ให้คำปรึกษา งานยื่นช่างฝีมือผู้ชำนาญการต่างประเทศ
                Workpermit/Visa BOI
              </p>
              <p>ให้คำปรึกษา งานยื่นขออนุญาตถือครองกรรมสิทธิ์ที่ดิน BOI</p>
              <p>ให้คำปรึกษา งานยื่นขออนุญาตลิซซิ่ง BOI</p>
              <p>ให้คำปรึกษา งานเครื่องจักร BOI</p>
              <p>ให้คำปรึกษา งานยื่นวัตถุดิบ BOI, IC</p>
            </Card>
          </Col>
        </Row>
      </Col>
    </Row>
  );
};
export default Financial;
